const teachers = [
    ["髙橋先生", "少林寺部顧問"],
    ["増田先生", "情報の先生"],
    ["藤野先生", "英語の先生　バドミントン部副顧問"],
    ["西田先生", "理科,科学の先生"],
    ["會見先生", "数学の先生　バドミントン部顧問"],
    ["前田先生", "公民の先生"],
    ["若原先生", "国語の先生"],
    ["玉本先生", "美術の先生"],
    ["郷先生", "軟式野球部　保険体育の先生"],
    ["武田先生", "日本史の先生　男子バスケ顧問"],
    ["大谷先生", "英語の先生"],
    ["齋藤先生", "世界史の先生　就職の担当"],
    ["三井先生", "少林寺部の先生　入試広報部 部長"],
    ["森田先生", "国語の先生"],
    ["春野先生", "英語の先生"],
    ["平柳先生", "数学の先生"],
    ["中野先生", "国語の先生"],
    ["西尾先生", "英語の先生　女子バレー部の先生"],
    ["砂本先生", "物理の先生　教務部の担当"],
    ["山下先生", "男子サッカー部顧問"],
    ["山科先生", "女子サッカー部顧問　保険体育の先生"],
    ["池田先生", "音楽の先生　吹奏楽部の顧問"],
    ["嶋田先生", "理科の先生　吹奏楽部顧問"],
    ["水島先生", "少林寺の先生"],
    ["足達先生", "校長　少林寺の先生"],
    ["高山先生", "数学の先生　卓球部の顧問"],
    ["酒井先生", ""],
    ["眞下先生", "地理,日本史先生"],
    ["坪木先生", "情報の先生　e-sportsの顧問"],
    ["辻井先生", "情報の先生"],
    ["先生", ""]
];

const gallery = document.getElementById("gallery");

teachers.forEach(teacher => {

    const name = teacher[0];
    const detail = teacher[1];

    gallery.innerHTML += `
        <div class="card" onclick="showDetail('${name}', '${detail}')">
            <div class="name">${name}</div>
        </div>
    `;
});

function showDetail(name, detail){

    document.getElementById("detail").innerHTML = `
        <h2>${name}</h2>
        <p>${detail}</p>
    `;
}
